In [1]:
import re

In [2]:
s = '1234567890'

In [4]:
len(s)

10

In [7]:
ax = re.match(pattern='\d{10}', string = s)

In [8]:
ax

In [9]:
type(ax)

re.Match

In [10]:
bool(ax)

True

In [12]:
ax.group() if bool(ax) else "error"

'1234567890'

In [13]:
ax = False

In [14]:
ax.group() if bool(ax) else "error"

'error'

In [16]:
ax = re.match(pattern='\d{10}', string = s)

In [17]:
s[ax.start()]

'1'

In [19]:
s[ax.end() - 1]

'0'

In [20]:
ax.group()

'1234567890'

In [21]:
ax.start()

0

In [22]:
ax.end()

10

In [23]:
ax.span()

(0, 10)

In [24]:
ax.group()

'1234567890'

In [25]:
s = '123 456 7890'

In [26]:
re.match(pattern='\d{3}\s\d{3}\s\d{4}', string = s)

In [27]:
s = '(123) 456-7890'

In [28]:
re.match(pattern='\(\d{3}\)\s\d{3}\-\d{4}', string = s)

In [29]:
s = '+1 (123) 456-7890'

In [30]:
re.match(pattern='\+\d\s\(\d{3}\)\s\d{3}\-\d{4}', string = s)

In [31]:
p = re.compile('\d{10}')
p.match('1234567890')

In [35]:
my_exp = lambda x : x ** 2

In [36]:
my_exp_c = lambda x, n : x ** n

In [37]:
my_exp(4)

16

In [38]:
my_exp_c(2, 4)

16

In [34]:
def my_exp(x):
    return x ** 2
def my_exp_c(x, n):
    return x ** n

In [39]:
my_exp(4)

16

In [40]:
my_exp_c(2, 4)

16

In [41]:
import pandas as pd

In [42]:
df = pd.DataFrame({
    'a' : [10, 20, 30],
    'b' : [20, 30, 40]
})

In [43]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [44]:
df['a'] ** 2

0    100
1    400
2    900
Name: a, dtype: int64

In [45]:
df['a'].apply(my_exp)

0    100
1    400
2    900
Name: a, dtype: int64

In [46]:
df['a'].apply(my_exp_c, n = 2)

0    100
1    400
2    900
Name: a, dtype: int64

In [47]:
df['a'].apply(my_exp_c, n = 3)

0     1000
1     8000
2    27000
Name: a, dtype: int64

In [48]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [49]:
printme = lambda x: print(x)

In [50]:
df.apply(printme)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [52]:
df.apply(printme, axis = 0)

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [53]:
df['a']

0    10
1    20
2    30
Name: a, dtype: int64

In [54]:
df['b']

0    20
1    30
2    40
Name: b, dtype: int64

In [55]:
def mymean(x):
    sum = 0
    for i in x:
        sum += i
    return sum / len(x)

In [ ]:
def mymena(x):
    sum = 0
    for i in x:
        sum += i
    return sum / df.shape[0]
# 열 방향 데이터 처리 코드
# 모든 열을 대상으로 할 때는 axis 0, 1 ( 행렬 반전 )

In [56]:
df.apply(mymean)

a    20.0
b    30.0
dtype: float64

In [57]:
df.mean()

a    20.0
b    30.0
dtype: float64

In [58]:
df.apply(mymean, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [59]:
import numpy as np

In [60]:
df.apply(np.mean, axis = 1)

0    15.0
1    25.0
2    35.0
dtype: float64

In [61]:
import seaborn as sns

In [62]:
df = sns.load_dataset("titanic")

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [64]:
isnan = lambda x : pd.isnull(x).sum()

In [65]:
df.apply(isnan)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [66]:
isnanp = lambda x : pd.isnull(x).sum() / x.size

In [67]:
df.apply(isnanp)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [76]:
isnanp = lambda x : pd.isnull(x).sum() / len(x)

In [69]:
df.apply(isnanp)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [72]:
def printx(x):
    print(x.size)

In [73]:
df.apply(printx)

891
891
891
891
891
891
891
891
891
891
891
891
891
891
891

survived       None
pclass         None
sex            None
age            None
sibsp          None
parch          None
fare           None
embarked       None
class          None
who            None
adult_male     None
deck           None
embark_town    None
alive          None
alone          None
dtype: object

In [74]:
def printx(x):
    print(len(x))

In [75]:
df.apply(printx)

891
891
891
891
891
891
891
891
891
891
891
891
891
891
891

survived       None
pclass         None
sex            None
age            None
sibsp          None
parch          None
fare           None
embarked       None
class          None
who            None
adult_male     None
deck           None
embark_town    None
alive          None
alone          None
dtype: object

In [81]:
b = df.apply(isnanp)
b

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [78]:
nonnanp = lambda x : 1 - (pd.isnull(x).sum() / x.size)

In [80]:
a = df.apply(nonnanp)
a

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

In [82]:
a + b

survived       1.0
pclass         1.0
sex            1.0
age            1.0
sibsp          1.0
parch          1.0
fare           1.0
embarked       1.0
class          1.0
who            1.0
adult_male     1.0
deck           1.0
embark_town    1.0
alive          1.0
alone          1.0
dtype: float64

In [90]:
cmis_row = df.apply(lambda x : pd.isnull(x).sum(), axis = 1 )
pmis_row = df.apply(lambda x : (pd.isnull(x).sum() / x.size), axis = 1)
pcom_row = df.apply(lambda x : 1 - ((pd.isnull(x).sum()) / x.size), axis = 1)

In [91]:
df['cmis'] = cmis_row
df['pmis'] = pmis_row
df['pcom'] = pcom_row

In [92]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,cmis,pmis,pcom
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2,0.111111,0.888889
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1,0.055556,0.944444
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2,0.111111,0.888889
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1,0.055556,0.944444
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2,0.111111,0.888889
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2,0.111111,0.888889
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,1,0.055556,0.944444
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,3,0.166667,0.833333
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1,0.055556,0.944444
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2,0.111111,0.888889

In [93]:
cmis_row

0      2
1      1
2      2
3      1
4      2
      ..
886    2
887    1
888    3
889    1
890    2
Length: 891, dtype: int64

In [94]:
pmis_row

0      0.111111
1      0.055556
2      0.111111
3      0.055556
4      0.111111
         ...
886    0.111111
887    0.055556
888    0.166667
889    0.055556
890    0.111111
Length: 891, dtype: float64

In [95]:
pcom_row

0      0.888889
1      0.944444
2      0.888889
3      0.944444
4      0.888889
         ...
886    0.888889
887    0.944444
888    0.833333
889    0.944444
890    0.888889
Length: 891, dtype: float64

In [96]:
df['missing'] = df.apply(lambda x : pd.isnull(x).sum(), axis = 1)

In [97]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,cmis,pmis,pcom,missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,2,0.111111,0.888889,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,1,0.055556,0.944444,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,2,0.111111,0.888889,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,1,0.055556,0.944444,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,2,0.111111,0.888889,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,2,0.111111,0.888889,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,1,0.055556,0.944444,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,3,0.166667,0.833333,2
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1,0.055556,0.944444,0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,2,0.111111,0.888889,1

In [98]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 19 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  cmis         891 non-null    int64
 16  pmis         891 non-null    float64
 17  pcom         891 non-null    float64
 18  missing      891 non-null    int64
dtypes: bool(2), category(2), float64(4), int64(6), object(5)
memory usage: 108.5+ KB

In [100]:
df[df['missing'] >= 2].sample(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,cmis,pmis,pcom,missing
573,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True,3,0.166667,0.833333,2
793,0,1,male,NaN,0,0,30.6958,C,First,man,True,NaN,Cherbourg,no,True,3,0.166667,0.833333,2
260,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,3,0.166667,0.833333,2
126,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,3,0.166667,0.833333,2
388,0,3,male,NaN,0,0,7.7292,Q,Third,man,True,NaN,Queenstown,no,True,3,0.166667,0.833333,2
250,0,3,male,NaN,0,0,7.2500,S,Third,man,True,NaN,Southampton,no,True,3,0.166667,0.833333,2
466,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True,3,0.166667,0.833333,2
653,1,3,female,NaN,0,0,7.8292,Q,Third,woman,False,NaN,Queenstown,yes,True,3,0.166667,0.833333,2
517,0,3,male,NaN,0,0,24.1500,Q,Third,man,True,NaN,Queenstown,no,True,3,0.166667,0.833333,2
495,0,3,male,NaN,0,0,14.4583,C,Third,man,True,NaN,Cherbourg,no,True,3,0.166667,0.833333,2

In [101]:
df = pd.read_csv('../data/gapminder.tsv', sep = '\t')

In [102]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [103]:
df.groupby('year')['lifeExp'].mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [104]:
df.groupby('year').lifeExp.mean()

year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [105]:
df['year'].unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [106]:
print(df['year'].unique())

[1952 1957 1962 1967 1972 1977 1982 1987 1992 1997 2002 2007]

In [108]:
ax = []
for i in df['year'].unique():
    ax.append(i)

In [109]:
ax

[1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002, 2007]

In [110]:
list(df['year'].unique())

[1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002, 2007]

In [111]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [114]:
df.loc[:,['country','continent']]

          country continent
0     Afghanistan      Asia
1     Afghanistan      Asia
2     Afghanistan      Asia
3     Afghanistan      Asia
4     Afghanistan      Asia
...           ...       ...
1699     Zimbabwe    Africa
1700     Zimbabwe    Africa
1701     Zimbabwe    Africa
1702     Zimbabwe    Africa
1703     Zimbabwe    Africa

[1704 rows x 2 columns]

In [115]:
df.loc[df.year == 1952, :]

                 country continent  year  lifeExp       pop    gdpPercap
0            Afghanistan      Asia  1952   28.801   8425333   779.445314
12               Albania    Europe  1952   55.230   1282697  1601.056136
24               Algeria    Africa  1952   43.077   9279525  2449.008185
36                Angola    Africa  1952   30.015   4232095  3520.610273
48             Argentina  Americas  1952   62.485  17876956  5911.315053
...                  ...       ...   ...      ...       ...          ...
1644             Vietnam      Asia  1952   40.412  26246839   605.066492
1656  West Bank and Gaza      Asia  1952   43.160   1030585  1515.592329
1668         Yemen, Rep.      Asia  1952   32.548   4963829   781.717576
1680              Zambia    Africa  1952   42.038   2672000  1147.388831
1692            Zimbabwe    Africa  1952   48.451   3080907   406.884115

[142 rows x 6 columns]

In [116]:
df[df['year'] == 1952]

                 country continent  year  lifeExp       pop    gdpPercap
0            Afghanistan      Asia  1952   28.801   8425333   779.445314
12               Albania    Europe  1952   55.230   1282697  1601.056136
24               Algeria    Africa  1952   43.077   9279525  2449.008185
36                Angola    Africa  1952   30.015   4232095  3520.610273
48             Argentina  Americas  1952   62.485  17876956  5911.315053
...                  ...       ...   ...      ...       ...          ...
1644             Vietnam      Asia  1952   40.412  26246839   605.066492
1656  West Bank and Gaza      Asia  1952   43.160   1030585  1515.592329
1668         Yemen, Rep.      Asia  1952   32.548   4963829   781.717576
1680              Zambia    Africa  1952   42.038   2672000  1147.388831
1692            Zimbabwe    Africa  1952   48.451   3080907   406.884115

[142 rows x 6 columns]

In [120]:
y1952 = df[df['year'] == 1952]['lifeExp'].mean()
y1957 = df[df['year'] == 1957]['lifeExp'].mean()
y1962 = df[df['year'] == 1962]['lifeExp'].mean()
y2007 = df[df['year'] == 2007]['lifeExp'].mean()

In [118]:
y1952

49.057619718309866

In [121]:
y1957

51.50740112676056

In [122]:
y1962

53.609249014084504

In [123]:
y2007

67.00742253521126

In [124]:
pd.DataFrame({
    'year' : [1952, 1957, 1962, 2007],
    "" : [y1952, y1957, y1962, y2007]
})

   year
0  1952  49.057620
1  1957  51.507401
2  1962  53.609249
3  2007  67.007423